  
TITLE Lab-3
;------------------------------------------------------------------------------
;ЛР  №3
;------------------------------------------------------------------------------
; Архітектура комп'ютера.
; Завдання:     Основи розробки і налагодження
; ВУЗ:          НТУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         1
; Група:        ІТ-01

;----------------------------I.ЗАГОЛОВОК ПРОГРАМИ------------------------------
IDEAL
MODEL SMALL
STACK 512
;-------------------------------II.МАКРОСИ-------------------------------------
                    ; Макрос для ініціалізації
MACRO M_Init		; Початок макросу 
    mov     ax,@data
    mov     ds,ax   ; ds = data segment
    mov     es,ax   ; es = text VRAM segment for direct VRAM writes
ENDM M_Init			; Кінець макросу

;----------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ------------------------------
DATASEG

; масив, який буде записано в пам'ять, а потім з неї надруковано
matrix db 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 'B', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 'O', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 'O', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 'D', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 'I', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 'D', 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 'K', 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 'V', 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 'V', 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 00h, 04h
       db 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h

BOARD_SIZE_X    EQU     16          ; Розмір масиву по осі Ох
BOARD_SIZE_Y    EQU     16          ; Розмір масиву по осі Оу
START_X         EQU     2           ; Координата Х верхнього лівого кута матриці
START_Y         EQU     2           ; Координата У верхнього лівого кута матриці
       
;-----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------------------
CODESEG

Start:	
M_Init
    mov ah, [matrix]                ; Запис масиву у старші біти регістру ah
    mov bx, 00h
    mov [bx], ah

     
end Start